# Taps
tap "auth0/auth0-cli"
tap "oven-sh/bun"
tap "shubh-io/tap"
tap "supabase/tap"

# ──────────────────────────────────────────────
# Formulae
# ──────────────────────────────────────────────

# Core / system
brew "ca-certificates"
brew "coreutils"
brew "gettext"
brew "libiconv"
brew "ncurses"
brew "openssl@3"
brew "readline"
brew "sqlite"
brew "tree"
brew "xz"
brew "zlib"
brew "zstd"

# Shell & terminal
brew "fzf"
brew "neovim"
brew "ripgrep"
brew "starship"
brew "htop"

# Git & version control
brew "git"
brew "gh"

# Languages & runtimes
brew "node"
brew "bun"
brew "pnpm"
brew "python@3.12"
brew "python@3.13"
brew "python@3.14"
brew "pyenv"
brew "pyenv-virtualenv"
brew "ruby"
brew "rust"
brew "dotnet"
brew "llvm"
brew "openjdk"
brew "sbcl"

# Version managers
brew "asdf"
brew "mise"

# Build tools
brew "m4"
brew "libtool"
brew "pkgconf"
brew "maven"

# Cloud & infra
brew "argocd"
brew "auth0"
brew "azure-cli"
brew "cloudflared"
brew "helm"
brew "k9s"
brew "kustomize"
brew "opentofu"

# Containers
brew "dive"
brew "lazydocker"

# Media / AV
brew "ffmpeg"
brew "tesseract"

# Networking
brew "caddy"
brew "sshpass"
brew "speedtest-cli"
brew "telnet"
brew "wget"

# AI / ML
brew "mlx"
brew "mlx-c"
brew "ollama"

# Database
brew "libpq"
brew "mysql-client"
brew "pgloader"

# Crypto & security
brew "age"
brew "mkcert"

# Other tools
brew "chezmoi"
brew "mas"
brew "dockmate"
brew "duti"
brew "opencode"
brew "stripe-cli"
brew "supabase"
brew "usage"

# ──────────────────────────────────────────────
# Casks
# ──────────────────────────────────────────────

# Browsers
cask "arc"
cask "firefox"
cask "google-chrome"
cask "google-chrome@canary"
cask "microsoft-edge"

# Development
cask "android-studio"
cask "datagrip"
cask "intellij-idea"
cask "visual-studio-code"

# Terminal
cask "ghostty"

# API / HTTP
cask "bruno"

# DevOps / Cloud
cask "gcloud-cli"
cask "google-cloud-sdk"

# Virtualization & containers
cask "orbstack"
cask "vmware-fusion"

# Passwords & security
cask "1password"
cask "1password-cli"
cask "keystore-explorer"

# Communication
cask "beeper"
cask "microsoft-teams"
cask "webex"

# Productivity
cask "obsidian"
cask "raycast"

# Music & media
cask "spotify"

# VPN / networking
cask "cloudflared"
cask "proton-mail"
cask "proton-mail-bridge"
cask "protonvpn"
cask "tailscale-app"
cask "vnc-viewer"

# Utilities
cask "caffeine"
cask "cmux"
cask "disk-drill"
cask "logi-options+"
cask "monitorcontrol"
cask "reflector"
cask "shottr"
cask "the-unarchiver"
cask "teamviewer"

# Microsoft Office (managed via brew, not auto-update)
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-word"

# Transcription
cask "macwhisper"

# Fonts
cask "font-fira-code"
cask "font-fira-code-nerd-font"

# Other
cask "granola"
cask "sublime-text"

# ──────────────────────────────────────────────
# Mac App Store
# ──────────────────────────────────────────────

mas "1Password for Safari", id: 1569813296
mas "AutoMounter", id: 1160435653
mas "Everhour", id: 1539652800
mas "Friendly Streaming", id: 553245401
mas "ifolor Designer", id: 446366603
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "OmniFocus", id: 1542143627
mas "Pages", id: 409201541
mas "Peek", id: 1554235898
mas "Pixelmator Pro", id: 1289583905
mas "WhatsApp", id: 310633997
mas "Windows App", id: 1295203466
mas "Xcode", id: 497799835
